Revit 2027 API
ApplicationEntryPoint Constructor
Initializes a new instance of the ApplicationEntryPoint class
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ApplicationEntryPoint()
Public Sub New
public:
ApplicationEntryPoint()
new : unit -> ApplicationEntryPoint
See Also
Reference
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace